{
    "macros": [
        {
            "file": "1766474623_bf1fd7.macro",
            "name": [
                "花拳•阴风扑面手",
                "花拳•陰風撲面手",
                "Bitch Slap"
            ],
            "desc": [
                "释放武器“真我本色”的技能“惊天手臂”，招式本身平庸且对手柄极不友好。爱护和平，禁止对手柄释放技能“婊气•奶凶小巴掌”。\r\n快捷键推荐：ZL\/R + 十字键\/Y\/B (Type A)",
                "釋放武器「真我本色」的技能「驚天手臂」，招式本身平庸且對手柄極不友好。愛護和平，禁止對手柄釋放技能「婊氣•奶兇小巴掌」。\r\n快捷鍵推薦：ZL\/R + 十字鍵\/Y\/B (Type A)",
                "Unleash the weapon Colour My World's skill \"Astounding Touch\". The move itself is underwhelming but notoriously demanding on controller. For the sake of peace, please refrain from subjecting your controller to rage-induced smashing, hurling, or BITCH SLAPPING.\r\nShortcut key(recommended): ZL\/R + DPAD\/Y\/B (Type A)"
            ],
            "author": "艾蓬瑾瑜",
            "downloads": 19
        },
        {
            "file": "1766482879_d72392.macro",
            "name": [
                "绣腿•闪电五连鞭",
                "繡腿•閃電五連鞭",
                "A (so-called) Lightning-Fast Five-Strike Arts"
            ],
            "desc": [
                "连续施展五次魔枪“真我本色”的技能“脑震荡回旋踢”，此招能造成毁灭性的破坏，但若采用“投机取巧地诱骗敌人，触发魔女时间后再发动偷袭”的战术并非正道，因此难以保证连环命中。招式传承自史诗级流明贤者——奥艺“松果、糖豆、闪电鞭”的创立者——天父•马。为发挥其潜藏的全部威力，请讲武德，好自为之。\r\n快捷键推荐：ZL\/R + 十字键\/Y\/B(Type A)",
                "連續施展五次魔槍「真我本色」的技能「腦震蕩回旋踢」，此招能造成毀滅性的破壞，但若采用“投機取巧地誘騙敵人，觸發魔女時間後再發動偷襲”的戰術並非正道，因此難以保證連環命中。招式傳承自史詩級流明賢者——奧藝“松果、糖豆、閃電鞭”的創立者——天父•馬。為發揮其潛藏的全部威力，請講武德，好自為之。\r\n快捷鍵推薦：ZL\/R + 十字鍵\/Y\/B(Type A)",
                "Unleash the weapon Colour My World's skill \"Concussion Step\" five times in a row. This technique delivers massive destruction — though the “cheese-and-sneak” tactic of luring enemies into Witch Time for an ambush is dishonorable at best, and as such, hardly guarantees a successful combo. Inspired by the legendary Lumen Sage, Father Ma, creator of the \"Pinecone Candy Lightning Whip\" technique, it demands to be wielded \"with honor and integrity\" to achieve its full potential.\r\nShortcut key(recommended): ZL\/R + DPAD\/Y\/B (Type A)"
            ],
            "author": "艾蓬瑾瑜",
            "downloads": 11
        },
        {
            "file": "1766677492_3dcdee.macro",
            "name": [
                "外道·黑魔法飞升",
                "外道·黑魔法飛升",
                "The Soaring Wicked"
            ],
            "desc": [
                "薇欧拉指挥小柴猫使用异次元黑洞Bug瞬移小型敌人，然后御剑飞升。\r\n使用Bug前，请先确认薇欧拉的3项技能(后述)处于启用状态，并且暂停召唤小柴猫：大鼓小猫、后燃器喷射踢、半音之月\r\n快捷键推荐使用 L + 十字键 (Type A)",
                "薇歐拉指揮小柴貓使用異次元黑洞Bug瞬移小型敵人，然後禦劍飛升。\r\n使用Bug前，請先確認薇歐拉的3項技能(後述)處於啟用狀態，並且暫停召喚小柴貓：「大鼓小貓」、「後燃器噴射踢」、「半音之月」\r\n快捷鍵推薦使用 L + 十字鍵 (Type A)",
                "Having fixed a fazing hex, the quick violet pussycat jumps over a lame dumb dawg.\r\nBuggy pulling only effects on lightweight enemy.\r\nBefore performing this arts, make sure to UNLOCK & ENABLE 3 skills for V.I.O.L.F*.A. and STOP summoning cheshire: After Burner Kick, Bass Boost, Chromatic Moon.\r\nShortcut key(recommended): L + DPAD (Type A)"
            ],
            "author": "艾蓬瑾瑜",
            "downloads": 3
        },
        {
            "file": "1766744680_569fab.macro",
            "name": [
                "颠颤·野蜂飞舞",
                "顛顫·野蜂飛舞",
                "Flight of the Bumblebee"
            ],
            "desc": [
                "薇欧拉运用“架刀衔接”(颠勺抖刀)的技巧快速施展组合技“三速两重”(PPPKK)，故技重施能令其或对手逐渐升空。训狗拆招？唯快不破(各打各的)！\r\n快捷键推荐： L + 十字键左\/上\/右 (Type A)",
                "薇歐拉運用「架刀銜接」(顛勺抖刀)的技巧快速施展組合技「三速兩重」(PPPKK)，故技重施能令其或對手逐漸升空。訓狗拆招？唯快不破(各打各的)！\r\n快捷鍵推薦： L + 十字鍵左\/上\/右 (Type A)",
                "Viola’s skill “Blocking Offset” lets her quickly release PPPKK combo in a buzzing glitchy way. Chain it successfully to launch opponent or keep gaining altitude when she is airborne. Read & React? Nah, we're going a Mash Fest!\r\nShortcut key(recommended): L + DPAD←\/↑\/→ (Type A)"
            ],
            "author": "艾蓬瑾瑜",
            "downloads": 1
        },
        {
            "file": "1766831345_676bba.macro",
            "name": [
                "禁忌·通幽役冥无缝偕·其一",
                "禁忌·通幽役冥無縫偕·其壹",
                "Tabú - Demon Slave Offset - Fragment I"
            ],
            "desc": [
                "失传的上古巫术之一,舞通巫，无缝偕？究竟是指预言占卜时以身为媒以舞降神的沟通之术，还是在祭祀活动中踏出从凡俗迈入灵域的步法？亦或与军事战争兵法相关？\r\n术者不详、神灵不详、祭器不详、牺牲不详、术式不详、仪容不详、契约不详\r\n快捷键：不明",
                "失傳的上古巫術之壹,舞通巫，「無縫偕」？究竟是指預言占蔔時以身為媒以舞降神的溝通之術，還是在祭祀活動中踏出從凡俗邁入靈域的步法？亦或與軍事戰爭兵法相關？\r\n術者不詳、神靈不詳、祭器不詳、犧牲不詳、術式不詳、儀容不詳、契約不詳\r\n快捷鍵：不明",
                "One Ancient shadow-craft lost for good! Whispers through ages ask: Was it a prophetic rite, the dancer’s body a living channel to descend the gods? A ceremonial crossing, a pace that traversed the veil between worlds in sacrifice? Or might its rhythms have encoded a deeper, older stratagem—a dance not of prayer, but of war?\r\nCaster: Undocumented\r\nFamiliar: Undocumented\r\nArtefact: Undocumented\r\nOffering: Undocumented\r\nSigil: Undocumented\r\nVestment: Undocumented\r\nPact: Undocumented\r\nShortcut Key: Unknown"
            ],
            "author": "艾蓬瑾瑜",
            "downloads": 1
        },
        {
            "file": "1767183842_5268ea.macro",
            "name": [
                "Let's Dance, Boys!",
                "Let's Dance, Boys!",
                "Pas de deux - Let's Dance, Boys!"
            ],
            "desc": [
                "每次兴起想再和你的魔性“达令”共舞一两小节，又担心赶不及炫耀下一场独舞？\r\n大胆地用上这项舞技，笙歌彻夜，群魔乱舞！\r\n技巧无法应用于武器：“死亡快车”、“利比特 力必多 BZ55”。\r\n执行空中组合技时，尽量先用闪避连击衔接召唤。\r\n快捷键推荐： ZL + Y + 十字键下 (Type A)",
                "每次興起想再和妳的魔性「達令」共舞壹兩小節，又擔心趕不及炫耀下壹場獨舞？\r\n大膽地用上這項舞技，笙歌徹夜，群魔亂舞！\r\n技巧無法應用於武器：「死亡快車」、「利比特 力必多 BZ55」。\r\n執行空中組合技時，盡量先用閃避連擊銜接召喚。\r\n快捷鍵推薦： ZL + Y + 十字鍵下 (Type A)",
                "Whenever you feel the urge to dance another bar, perhaps two, with your demonic \"Darling\", but worry you won't make it to show off your next solo?\r\nConfidently apply this dance skill，as long as there’s music, you’ll keep on dancing!\r\nThis technique is ineffective when equipping with Dead End Express & Ribbit Libido BZ55.\r\nWhen performing mid-air combos, prioritize linking with dodge offset before summoning.\r\nShortcut key(recommended): ZL + Y + DPAD ↓ (Type A)"
            ],
            "author": "艾蓬瑾瑜",
            "downloads": 1
        }
    ]
}