{
    "macros": [
        {
            "file": "1766368609_oxf6bz.macro",
            "name": [
                "下蛋飞雷神",
                "下蛋飛雷神",
                "Bomb Thunderclap Rush"
            ],
            "desc": [
                "用下蛋接前跳、引爆、再加后空翻的方式，提高腾空高度，从而触发飞雷神。\r\n触发宏后，不要有额外操作，等突袭Y键标识出来即可",
                "用下蛋接前跳、引爆、再加後空翻的方式，提高騰空高度，從而觸發飛雷神。\r\n觸發宏後，不要有額外操作，等突襲Y鍵標識出來即可",
                "Use drop egg to connect forward jump, detonate, and then backflip method, increase aerial height, thus trigger Flying Thunder God\r\nAfter triggering the macro, do not perform extra actions, just wait until the Flurry Rush Y button indicator appears"
            ],
            "author": "TOM",
            "downloads": 197
        },
        {
            "file": "1766368609_rv83sw.macro",
            "name": [
                "落差风弹",
                "落差風彈",
                "Drop Wind Bomb"
            ],
            "desc": [
                "身上必须装备有弓箭，不用提前拿出炸弹。\r\n直接空手站在台阶边缘，背朝台阶使用，林克与面朝方向的地面有高度落差",
                "身上必須裝備了弓箭\r\n站在臺階邊緣，背朝臺階使用\r\n無需事先選好炸彈",
                "You must have a bow equipped\r\nStand on the edge of the step with your back facing it\r\nNo need to pre‑select the bomb"
            ],
            "author": "TOM",
            "downloads": 150
        },
        {
            "file": "1766368609_nfb8p1.macro",
            "name": [
                "空中接力风弹",
                "空中接力風彈",
                "Aerial Wind Bomb"
            ],
            "desc": [
                "需要先选好圆形炸弹\r\n当你飘在空中不在有位移时使用\r\n可以通过观察滑翔伞尾翼的气流判断\r\n宏里面已经处理了摇杆，所以除了宏什么都别按",
                "需要先選好圓形炸彈\r\n當你飄在空中不在有位移時使用\r\n可以通過觀察滑翔傘尾翼的氣流判斷\r\n宏裏面已經處理了搖桿，所以除了宏什麼都別按",
                "Make sure the round bomb is selected first\r\nUse when you are floating in the air without any movement\r\nYou can judge by observing the airflow at the tail of the glider\r\nThe macro has already handled the joystick, so do not press anything else except the macro"
            ],
            "author": "TOM",
            "downloads": 190
        },
        {
            "file": "1766409101_753bd5.macro",
            "name": [
                "平地飞雷神（B键跳）",
                "平地飛雷神（B鍵跳）",
                "BombTCR (B jump)"
            ],
            "desc": [
                "修改自TOM大佬的平地飞雷神，b键位跳跃的可以下这个\r\n平地使用装备盾牌和单手剑，使用之前必须获取飞雷神标记，挨打或者盾挡一次近战攻击。触发后不要动，等出现y提示时按y即可发动飞雷神。",
                "修改自TOM大佬的平地飛雷神，B鍵跳躍的可以下載這個\r\n平地使用裝備盾牌和單手劍，使用之前必須獲得飛雷神標記，受到攻擊或盾牌格擋一次近戰攻擊",
                "Modified from TOM's TCR, this version uses the B button to jump\r\nOn the ground, equip a shield and a one-handed sword. Before use, you must obtain the Thunderclap mark. Take a hit or block one melee attack with the shield"
            ],
            "author": "星之晨光",
            "downloads": 102
        },
        {
            "file": "1766471164_ce3942.macro",
            "name": [
                "不消耗精力奔跑",
                "不消耗精力奔跑",
                "Run Without Stamina Consumption"
            ],
            "desc": [
                "让林克可以持续高速奔跑并且不消耗精力\r\n建议将该脚本快捷键设置为ZL+B\r\n在你推动摇杆使林克移动时，同时按下ZL和B触发这个宏，林克就可以高速奔跑并且不消耗精力\r\n这个宏只有10s时间，如果你想要长时间奔跑，可以启动宏时ZL和B同时长按0.5s，这样可以持续循环播放该宏\r\n你在设置宏快捷键的页面可以看到宏播放的使用方法\r\n在你想要结束该宏时，应该先按ZL再同时按下B，否则会在结束时漏出口哨声",
                "讓林克可以持續高速奔跑並且不消耗精力\r\n建議將該腳本快捷鍵設定為 ZL + B\r\n當你推動搖桿使林克移動時，同時按下 ZL 和 B 觸發這個宏，林克就可以高速奔跑並且不消耗精力。\r\n這個宏只有10秒時間，如果你想要長時間奔跑，可以啟動宏時 ZL 和 B 同時長按0.5秒，這樣可以持續循環播放該宏。\r\n你在設定宏快捷鍵的頁面可以看到宏播放的使用方法。\r\n在你想要結束該宏時，應該先按 ZL，再同時按下 B，否則會在結束時漏出口哨聲。",
                "Allow Link to continuously run at high speed without consuming stamina.\r\nIt is recommended to set the macro hotkey to ZL + B.\r\nWhen you push the joystick to move Link and press ZL and B simultaneously to trigger this macro, Link will run at high speed without stamina consumption.\r\nThis macro lasts for only 10 seconds. If you want to run for a longer time, press and hold ZL and B for 0.5 seconds when starting the macro to enable continuous loop playback.\r\nYou can see instructions on how to use the macro playback on the macro hotkey settings page.\r\nWhen you want to stop the macro, you should press ZL first, then press B simultaneously. Otherwise, a whistle sound may be missed when ending the macro."
            ],
            "author": "忘忧",
            "downloads": 84
        },
        {
            "file": "1766504438_436935.macro",
            "name": [
                "原地风弹（60帧专用）",
                "原地風彈（60 幀專用）",
                "Stationary Windbomb (60 FPS Only)"
            ],
            "desc": [
                "需要先选圆形炸弹。",
                "需要先選擇圓形炸彈。",
                "You must select the Round Bomb first."
            ],
            "author": "小杜加点醋",
            "downloads": 88
        },
        {
            "file": "1766538848_204c07.macro",
            "name": [
                "举盾落差风弹",
                "舉盾落差風彈",
                "Shield-Holding Drop Airstrike"
            ],
            "desc": [
                "选择好圆形炸弹，启动宏，自动举盾起跳同时下蛋。速度快，效率高。对地形基本没要求。",
                "選擇好圓形炸彈。啟動宏，自動舉盾，起跳同時下蛋。速度快，效率高，對地形基本沒要求。",
                "Must choose circling Bob， The start。"
            ],
            "author": "FCH",
            "downloads": 101
        },
        {
            "file": "1766690633_eed214.macro",
            "name": [
                "风弹（少量往上飞）",
                "風彈（少量向上飛）",
                "Wind Bomb (Slight Upward Launch)"
            ],
            "desc": [
                "",
                "",
                ""
            ],
            "author": "忘忧",
            "downloads": 46
        },
        {
            "file": "1766693786_753e95.macro",
            "name": [
                "飞天风弹",
                "飛天風彈",
                "High Altitude Wind Bomb"
            ],
            "desc": [
                "",
                "",
                ""
            ],
            "author": "忘忧",
            "downloads": 87
        },
        {
            "file": "1766697707_04d953.macro",
            "name": [
                "一飞冲天垂直风弹",
                "一飛沖天垂直風彈",
                "Straight-Up Wind Bomb"
            ],
            "desc": [
                "",
                "",
                ""
            ],
            "author": "忘忧",
            "downloads": 70
        },
        {
            "file": "1769943604_6f47e1.macro",
            "name": [
                "SPS存档视窗残留",
                "SPS存檔視窗殘留",
                "SPS"
            ],
            "desc": [
                "可以达成在存档界面依然可以操纵林克的效果 进而在过场动画时存档\r\n先确保地图界面的光标停留在任意图鉴上 背包界面的光标停留在传送标记器上（放在第二排任意位置）退出背包 同时按A和B触发 注意，这不是百分百成功的，成功率在25%左右",
                "可以達成在存檔介面依然可以操縱林克的效果，進而在過場動畫時存檔。先確保地圖介面的游標停留在任意圖鑑上，背包介面的游標停留在傳送標記器上（放在第二排任意位置）。退出背包，同時按A和B觸發。注意，這不是百分之百成功的，成功率約為25%左右。",
                "It is possible to achieve an effect where Link can still be controlled on the save interface, allowing saving during cutscenes. First, ensure the cursor on the map interface stays on any log entry, and the cursor in the inventory interface stays on the travel medallion (placed in any position in the second row). Exit the inventory, then press A and B simultaneously to trigger it. Note that this is not 100% successful, with a success rate of around 25%."
            ],
            "author": "Mofei",
            "downloads": 8
        }
    ]
}